a = (int(input("Введите радиус круга в сантиметрах"))) 
#строка для ввода радиуса
l = 2*3.14*a
#формула длины в см
s = 2*3.14*a**2
#формула площфди в см
lm = l/100
#формула длины в м 
sm = s/100
#формула длины в м 
print ( "длина в сантитметрах:",l , "длина в метрах:",lm, "площадь в сантиметрах",s , "площадь в метрах:", sm)
#выводим посчитанные из формул значения 
d = a*2**0.5
#формула стороны вписанного в окружность квадрата 
dm = d/100
#то же самое только в м 
h = a**3**0.5
#формула вписанного в окружность равностороннего треугольника 
hm = h/100
#то же самое в метрах 
print ("сторона вписанного в окружность квадрата в сантиметрах:", d, "сторона вписанного в окружность квадрата: в метрах", dm, "сторона равносторенного треугольника в сантимеьтрах:", h, "сторона равносторенного треугольника в метрах:", hm)
#выводим на экран все значения 
k = 2*a
#формула стороны описанного около окружности квадрата
km = k/100
#та же самая формула в метрах 
j = 2*3**0.5*a
#формула стороны описанного около окружности равностороннегоитреугольника 
jm = j/100
#та же самая формула в метрах 
p = 2*(2**0.5-1)*a
#формула стороны описанного около окружность правильного восьмиугольника 
pm = p/100
#та же самая формула в метрах 
print ("сторона описанного вокруг окружности квадрата в сантметрах:", k, "сторона описанного вокруг окружности квадрата в метрах:", km, "сторона равностороннего треугольника в сантиметрах:", j, "сторона равностороннего треугольника в метрах:", jm , "сторона правильного восьмиугольника в сантиметрах:", p, "сторона правильного восьмиугольника в метрах:", pm)
#выводим на экран все значвения
